{"dev/2025-06-13-how-i-m-using-quartz-and-obsidian-to-power-my-blog":{"slug":"dev/2025-06-13-how-i-m-using-quartz-and-obsidian-to-power-my-blog","filePath":"dev/2025-06-13-how-i-m-using-quartz-and-obsidian-to-power-my-blog.md","title":"How I’m Using Quartz and Obsidian to Power My Blog","links":[],"tags":[],"content":"As someone who loves coding and creates music as a hobby, I’ve always been on the lookout for tools that give me full control over my website while keeping things simple. I don’t need a complex system for blogging. I just want something efficient, flexible, and easy to maintain. That’s when I stumbled upon Quartz, a static website generator that promises speed and simplicity. Paired with Obsidian, the knowledge management app I’ve been using for a while, I’ve found a great combination for writing, organizing, and publishing my posts. Let me take you through how I’m using both of these tools and why I’m excited about the future of my blog.\nWhy Static Websites?\nStatic websites are exactly what they sound like—pre-built HTML, CSS, and JavaScript files that don’t need server-side processing or databases to work. This makes them fast, secure, and simple to manage.\nI’ve spent years experimenting with different website builders, but none of them quite fit. They were easy to use, sure, but they always felt a bit too restrictive or bloated with unnecessary features. I wanted a more streamlined, customizable experience that didn’t require me to start from scratch but also didn’t lock me into a template. That’s when I discovered Quartz, a minimalist static site generator. It keeps things simple and flexible, which is exactly what I needed.\nThe Power of Quartz\nWhat drew me to Quartz was its simplicity. You write your posts in markdown, and Quartz takes care of the rest—no complex setup or extra configurations to worry about. It’s all about the content, which is a huge plus for me.\nHere’s how I’m using Quartz and Obsidian together:\n\n\nBrainstorming &amp; Drafting: I use Obsidian to jot down ideas, organize thoughts, and connect concepts. I love Obsidian’s graph view; it helps me visualize connections between different topics and discover ideas I might not have thought of otherwise. This makes the writing process feel much more fluid and connected.\n\n\nWriting: Obsidian’s markdown editor allows me to seamlessly link back to other notes, which helps me stay organized and expand on ideas I’ve already worked through. The process feels a bit like building a puzzle, where all the pieces fit together.\n\n\nExporting to Quartz: After I’ve finished writing, I export the markdown file and drop it into my Quartz directory. Quartz then takes that markdown file and generates a clean, simple webpage—no additional steps required. It just works.\n\n\nPublishing: Finally, I push the static files to a hosting service called GitHub Pages. The entire process is fast and efficient, with no complex backend systems to deal with.\n\n\nWhy This Setup Works for Me\nThe Quartz + Obsidian combination works so well because of a few key reasons:\n\nSimplicity: I don’t have to worry about themes, plugins, or complicated customizations. Quartz allows me to focus on what’s important; writing and sharing my thoughts.\nMarkdown: Both Quartz and Obsidian use markdown, which is incredibly easy to work with. No messy HTML or confusing editors; just plain, readable text that turns into beautifully styled pages.\nLocal Control: One of my favorite things about Obsidian is that all my notes are stored locally. I don’t have to rely on third-party services or worry about data disappearing if something goes wrong.\nSpeed &amp; Security: Static sites are fast and secure. There’s no database or server-side processing to slow things down, and I don’t have to worry about the usual security concerns that come with dynamic websites.\n\nThe Road Ahead\nI’m still learning the ins and outs of Quartz, especially when it comes to customizing themes and diving into more advanced features. But honestly, I’m enjoying the journey. It feels empowering to have full control over my blog and to create something that’s both functional and personal.\nLooking ahead, I’d like to add more features, like automating my publishing process, using GitHub workflows, and giving my site a boost with some SEO improvements. The beauty of static sites is that the possibilities are endless, and I’m excited to see how far I can take it.\nIf you’re someone who values simplicity, speed, and control, I highly recommend giving Quartz a try. And if you’re already using Obsidian to organize your notes, the integration between the two will make your workflow even smoother.\nFor me, the goal isn’t to become a “content creator.” It’s to build something that reflects my voice, helps me stay organized, and gives me an efficient way to share what I’ve learned. I’m excited to continue experimenting, writing, and seeing where this blog takes me."},"index":{"slug":"index","filePath":"index.md","title":"Welcome","links":[],"tags":[],"content":"Hey there! I’m Allister Isaiah Harvey — a developer and music enthusiast who loves blending code and creativity. I spend my days building digital solutions and my free time exploring my passion for music, creating new tracks, and sharing them online.\nThis blog is a mix of everything I’m passionate about—coding, music, and the creative process. Here, you’ll find a combination of development insights, personal reflections, and the occasional update on my latest music releases.\nI hope this space inspires you, whether you’re into programming, music, or both! Thanks for stopping by."}}